In [1]:
import pandas as pd
df = pd.read_csv('./usuarios.csv')
df

   id          nombre                       email fecha_registro
0   1      Juan Perez      juan.perez@example.com     2023-01-15
1   2     Maria Gomez     maria.gomez@example.com     2023-02-20
2   3  Carlos Sanchez  carlos.sanchez@example.com     2023-03-30

# Eliminar columnas

In [2]:
df.drop('fecha_registro', axis=1, inplace=True)

# Eliminar filas

In [3]:
df.drop(0,axis=0)

   id          nombre                       email
1   2     Maria Gomez     maria.gomez@example.com
2   3  Carlos Sanchez  carlos.sanchez@example.com

# Agregar una columna

In [4]:
df['new_col'] = 0
df

   id          nombre                       email  new_col
0   1      Juan Perez      juan.perez@example.com        0
1   2     Maria Gomez     maria.gomez@example.com        0
2   3  Carlos Sanchez  carlos.sanchez@example.com        0

# Agregar una fila

In [5]:
df.loc[10] = ['1','2','10',4]

df

   id          nombre                       email  new_col
0   1      Juan Perez      juan.perez@example.com        0
1   2     Maria Gomez     maria.gomez@example.com        0
2   3  Carlos Sanchez  carlos.sanchez@example.com        0
10  1               2                          10        4